# Pandas Tutorial

Pandas is a Python library providing high-performance, easy-to-use data structures and data analysis tools

Pandas deals with the following three data structures:

    Series
    DataFrame
    Panel (ignore this one for now)

### Importing the modules

In [1]:
import pandas as pd
import numpy as np

## Descriptive statistics

In [2]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

## Sum(axis)

In [3]:
print (df.sum(axis=0)) #sum of values in each column ,type doesn't matter

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [12]:
print (df.sum(axis=1)) #sum of only numerical values in each row

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [14]:
print (df[['Age']].sum(axis=0))

Age    382
dtype: int64

## mean()
returns the average value

In [1]:
help(df.mean())

NameError: name 'df' is not defined

In [15]:
df.mean()  #of the numerical columns

Name      4.940656e-324
Age        3.183333e+01
Rating     3.743333e+00
dtype: float64

## std()
returns standard deviation only for the numerical columns

In [16]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

## Summarizing Data
describe() computes the summary of statistics

In [17]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [18]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

## Reindexing

In [23]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df_reindexed = df1.reindex(index=[0,2,5,10,8])

print(df1)
print('\n')
print(df_reindexed)

       col1      col2      col3
0 -0.886680  1.734444  1.903576
1  0.879628  2.592553  0.534342
2  0.165099 -1.080740 -1.672454
3  0.007112  0.861065  0.788278
4 -2.461485 -1.227246  0.237600


        col1      col2      col3
0  -0.886680  1.734444  1.903576
2   0.165099 -1.080740 -1.672454
5        NaN       NaN       NaN
10       NaN       NaN       NaN
8        NaN       NaN       NaN

In [25]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])


print(df1)
print('\n')

print(df2)
print('\n')


df1 = df2.reindex_like(df1)
print(df1)

       col1      col2      col3
0  0.862343  0.370098 -0.051025
1 -0.570138  0.229210 -0.110619
2 -0.585091 -0.838918 -0.454704
3 -1.749582  1.687142  1.199832
4  0.606056  0.033099  0.744896
5  0.128829  1.273072 -1.531512
6 -1.054305 -0.317169  0.286325
7 -0.409176 -1.298503  1.582048
8 -1.098633 -0.671524  0.473978
9 -0.878348  0.188816  0.010210


       col1      col2      col3
0  0.176893  0.768199  0.950952
1 -0.557674  1.893625  1.112693
2  1.039550  0.357285  0.006935
3  0.642733  1.806327 -1.049456
4 -0.893709  2.037476  2.538202
5 -0.908658 -0.562832  1.026094
6 -0.743085  1.206578 -0.198901


       col1      col2      col3
0  0.176893  0.768199  0.950952
1 -0.557674  1.893625  1.112693
2  1.039550  0.357285  0.006935
3  0.642733  1.806327 -1.049456
4 -0.893709  2.037476  2.538202
5 -0.908658 -0.562832  1.026094
6 -0.743085  1.206578 -0.198901
7       NaN       NaN       NaN
8       NaN       NaN       NaN
9       NaN       NaN       NaN

## Changing the indexing

In [16]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

print(df1)
print('\n')

df1.index = [0,2,5,10,8]
df1

       col1      col2      col3
0 -0.739429  1.885878 -0.456043
1 -0.474854 -0.029793  1.435341
2 -1.283025 -1.090593 -0.208259
3 -0.166622  2.008848 -0.694461
4  1.053496  0.458248 -1.428384

        col1      col2      col3
0  -0.739429  1.885878 -0.456043
2  -0.474854 -0.029793  1.435341
5  -1.283025 -1.090593 -0.208259
10 -0.166622  2.008848 -0.694461
8   1.053496  0.458248 -1.428384

## Renaming rows and columns

In [28]:
print(df1)
print (df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'}, index = {0 : 'apple', 1 : 'banana', 2 : 'durian'}))

       col1      col2      col3
0  0.176893  0.768199  0.950952
1 -0.557674  1.893625  1.112693
2  1.039550  0.357285  0.006935
3  0.642733  1.806327 -1.049456
4 -0.893709  2.037476  2.538202
5 -0.908658 -0.562832  1.026094
6 -0.743085  1.206578 -0.198901
7       NaN       NaN       NaN
8       NaN       NaN       NaN
9       NaN       NaN       NaN
              c1        c2      col3
apple   0.176893  0.768199  0.950952
banana -0.557674  1.893625  1.112693
durian  1.039550  0.357285  0.006935
3       0.642733  1.806327 -1.049456
4      -0.893709  2.037476  2.538202
5      -0.908658 -0.562832  1.026094
6      -0.743085  1.206578 -0.198901
7            NaN       NaN       NaN
8            NaN       NaN       NaN
9            NaN       NaN       NaN

## Iterating a DataFrame

### Iterating over columns

In [30]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

print(df)
print('\n')

for x in df:
    print(x)

       col1      col2      col3
0 -0.530235 -1.912833 -0.087046
1 -3.353881  0.461588 -2.430443
2 -0.667094 -1.675082 -1.194077
3 -0.140080 -0.107005 -0.418815
4 -0.388744  0.683079  0.129245


col1
col2
col3

In [32]:
print(df)
print('\n')

for x in df.iteritems():
    print (x)
    print(type(x[1]))
    print('\n')

       col1      col2      col3
0 -0.530235 -1.912833 -0.087046
1 -3.353881  0.461588 -2.430443
2 -0.667094 -1.675082 -1.194077
3 -0.140080 -0.107005 -0.418815
4 -0.388744  0.683079  0.129245


('col1', 0   -0.530235
1   -3.353881
2   -0.667094
3   -0.140080
4   -0.388744
Name: col1, dtype: float64)
<class 'pandas.core.series.Series'>


('col2', 0   -1.912833
1    0.461588
2   -1.675082
3   -0.107005
4    0.683079
Name: col2, dtype: float64)
<class 'pandas.core.series.Series'>


('col3', 0   -0.087046
1   -2.430443
2   -1.194077
3   -0.418815
4    0.129245
Name: col3, dtype: float64)
<class 'pandas.core.series.Series'>

In [34]:
print(df)
print('\n')
print(type(df.iteritems()))
for key,value in df.iteritems():
    print (key)
    print(value)
    print('\n')

       col1      col2      col3
0 -0.530235 -1.912833 -0.087046
1 -3.353881  0.461588 -2.430443
2 -0.667094 -1.675082 -1.194077
3 -0.140080 -0.107005 -0.418815
4 -0.388744  0.683079  0.129245


<class 'generator'>
col1
0   -0.530235
1   -3.353881
2   -0.667094
3   -0.140080
4   -0.388744
Name: col1, dtype: float64


col2
0   -1.912833
1    0.461588
2   -1.675082
3   -0.107005
4    0.683079
Name: col2, dtype: float64


col3
0   -0.087046
1   -2.430443
2   -1.194077
3   -0.418815
4    0.129245
Name: col3, dtype: float64

### Iterating over rows

In [37]:
print(df)
print('\n')

for row_index,row in df.iterrows():
    print (row_index)
    print(row)
    print(type(row))
    print('\n')

       col1      col2      col3
0 -0.530235 -1.912833 -0.087046
1 -3.353881  0.461588 -2.430443
2 -0.667094 -1.675082 -1.194077
3 -0.140080 -0.107005 -0.418815
4 -0.388744  0.683079  0.129245


0
col1   -0.530235
col2   -1.912833
col3   -0.087046
Name: 0, dtype: float64
<class 'pandas.core.series.Series'>


1
col1   -3.353881
col2    0.461588
col3   -2.430443
Name: 1, dtype: float64
<class 'pandas.core.series.Series'>


2
col1   -0.667094
col2   -1.675082
col3   -1.194077
Name: 2, dtype: float64
<class 'pandas.core.series.Series'>


3
col1   -0.140080
col2   -0.107005
col3   -0.418815
Name: 3, dtype: float64
<class 'pandas.core.series.Series'>


4
col1   -0.388744
col2    0.683079
col3    0.129245
Name: 4, dtype: float64
<class 'pandas.core.series.Series'>

### Note:
Do not try to modify any object while iterating. Iterating is meant for reading and the iterator returns a copy of the original object (a view), thus the changes will not reflect on the original object.

## Sorting

### Sorting by Value

In [39]:
?unsorted_df.sort_values

In [38]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1') #kind='mergesort'

print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

### Sorting by index

In [40]:
unsorted_df = pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns = ['col2','col1'])
sorted_df=unsorted_df.sort_index()

print(unsorted_df)
print('\n')
print(sorted_df)

       col2      col1
1 -1.170348 -1.423402
4  1.146070 -0.118820
6 -0.581313  0.990925
2 -1.997279  0.443938
3  0.287628  0.706692
5  0.828429  0.262065
9 -0.698614  0.673255
8  0.471513  1.474865
0  1.055381  0.319740
7  0.614070  0.129203


       col2      col1
0  1.055381  0.319740
1 -1.170348 -1.423402
2 -1.997279  0.443938
3  0.287628  0.706692
4  1.146070 -0.118820
5  0.828429  0.262065
6 -0.581313  0.990925
7  0.614070  0.129203
8  0.471513  1.474865
9 -0.698614  0.673255

## Indexing and selecting data

### .loc, .iloc(use integer indexing) and .ix(the mix of 2, deprecated)

In [41]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

#select all rows for specific columns
print(df)
print('\n')
print(df.loc[:,['A','B']])
print('\n')

          A         B         C         D
a  0.258146  0.155290  0.283488  0.486764
b  1.071657 -1.413397  1.020753 -0.768205
c  0.081042  1.199593  1.001930 -0.563609
d  0.457149  1.402613  0.952441 -0.481370
e  0.758298  0.924877  2.465084  0.325823
f  1.416650  0.133135  1.478060  1.897016
g  2.256948  1.833785  1.187177  0.946236
h  0.198348  0.921463  0.908742  0.207661


          A         B
a  0.258146  0.155290
b  1.071657 -1.413397
c  0.081042  1.199593
d  0.457149  1.402613
e  0.758298  0.924877
f  1.416650  0.133135
g  2.256948  1.833785
h  0.198348  0.921463

In [42]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


#select some rows for specific columns
print(df)
print('\n')
print(df.loc[['a','b'],['A','B']])
print('\n')

          A         B         C         D
a  0.826768  0.081365 -1.772656  2.050085
b  0.381120  1.483485 -2.162560  0.127626
c  0.877909  0.238231 -0.004985 -1.164878
d -0.088700 -0.517629  0.004834  1.244071
e  0.467892  1.321339  0.861057 -0.798342
f  1.918420  0.321144  1.666179  0.774168
g  0.259405 -1.482359 -2.163916  0.946284
h -0.244987 -2.827648  0.036814 -1.034210


          A         B
a  0.826768  0.081365
b  0.381120  1.483485

In [44]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.loc['a']>0)
print('\n')

          A         B         C         D
a  1.115472  0.119495  1.752629 -1.479734
b -0.694740  0.015148 -1.464774 -0.638582
c -0.503424  0.921401  0.886102  0.465442
d  1.370605 -0.554722  0.055851  0.275019
e -0.745950 -1.527911 -0.448658  0.570886
f  0.778087  0.345022 -0.648218  1.149214
g -1.221881 -0.109672 -0.714070 -1.218938
h -0.895979 -0.289726 -0.187576  0.349194


A     True
B     True
C     True
D    False
Name: a, dtype: bool

In [48]:
df.loc['a','B'] = 10000
df

          A             B         C         D  (a, B)
a  1.115472  10000.000000  1.752629 -1.479734   10000
b -0.694740      0.015148 -1.464774 -0.638582   10000
c -0.503424      0.921401  0.886102  0.465442   10000
d  1.370605     -0.554722  0.055851  0.275019   10000
e -0.745950     -1.527911 -0.448658  0.570886   10000
f  0.778087      0.345022 -0.648218  1.149214   10000
g -1.221881     -0.109672 -0.714070 -1.218938   10000
h -0.895979     -0.289726 -0.187576  0.349194   10000

In [51]:
df['A'] = 10000
df

       A             B         C         D  (a, B)  (a, A)
a  10000  10000.000000  1.752629 -1.479734   10000   10000
b  10000      0.015148 -1.464774 -0.638582   10000   10000
c  10000      0.921401  0.886102  0.465442   10000   10000
d  10000     -0.554722  0.055851  0.275019   10000   10000
e  10000     -1.527911 -0.448658  0.570886   10000   10000
f  10000      0.345022 -0.648218  1.149214   10000   10000
g  10000     -0.109672 -0.714070 -1.218938   10000   10000
h  10000     -0.289726 -0.187576  0.349194   10000   10000

In [52]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

print(df)
print('\n')
print(df.iloc[[0,1],[0,1]])
print('\n')

          A         B         C         D
a  0.876699 -0.641512  1.710212  0.139643
b  0.110571  2.190703 -1.418310  1.562049
c -0.403823  1.054495 -1.337102  0.061561
d -2.813062 -1.129689  0.221792 -1.465130
e  1.582268  0.993930 -1.681700  0.152035
f -0.899295  0.027251 -0.481491 -0.399839
g  0.192728 -0.472795 -1.870746 -0.531290
h -0.157373  0.061415  0.388757  0.098967


          A         B
a  0.876699 -0.641512
b  0.110571  2.190703

In [53]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.iloc[0:3,[0,1]])
print('\n')

          A         B         C         D
a -0.692335  2.676531 -0.883585  1.333172
b -1.163907 -0.537406 -1.021698  2.174502
c  1.358573 -0.146881  0.400455  1.110341
d  1.283093 -0.480444  1.272692 -0.466552
e  0.702724  0.045457 -0.223884  1.408516
f -0.043985 -0.509924  0.790631 -0.948628
g -0.432403 -1.279397  1.694345 -0.014580
h -0.171414  0.613783  0.326136  0.488360


          A         B
a -0.692335  2.676531
b -1.163907 -0.537406
c  1.358573 -0.146881

In [54]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.ix[:,'A'])

          A         B         C         D
a  0.427928  0.574566  0.165276 -1.700216
b  0.307585 -0.543570  1.326506  1.082013
c -0.040400  1.189062 -1.638333  1.187976
d  0.999791 -0.087311 -0.130326  0.661294
e  0.691873  0.477732 -0.170079 -1.128638
f  0.464286 -0.136322  1.198796  1.434815
g -0.658623  0.738193  0.373768  0.482012
h -0.257255 -1.164271 -0.404536  0.857642


a    0.427928
b    0.307585
c   -0.040400
d    0.999791
e    0.691873
f    0.464286
g   -0.658623
h   -0.257255
Name: A, dtype: float64

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  import sys

## Missing values

In [55]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a -0.608527  0.796978 -0.884189
b       NaN       NaN       NaN
c -0.430152 -0.837826 -0.405819
d       NaN       NaN       NaN
e -0.810995  0.445044  0.816048
f -0.368439  0.056796  0.961981
g       NaN       NaN       NaN
h  0.164091 -0.048992  1.284001

In [56]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [57]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

### Replacing the missing data

In [58]:
df1 = df.fillna(0)
df1

        one       two     three
a -0.608527  0.796978 -0.884189
b  0.000000  0.000000  0.000000
c -0.430152 -0.837826 -0.405819
d  0.000000  0.000000  0.000000
e -0.810995  0.445044  0.816048
f -0.368439  0.056796  0.961981
g  0.000000  0.000000  0.000000
h  0.164091 -0.048992  1.284001

In [59]:
?df.fillna

### See some other options that fillna() provides in the python documentation :)

### Dropping the missing data

In [60]:
df2 = df.dropna()
df2

        one       two     three
a -0.608527  0.796978 -0.884189
c -0.430152 -0.837826 -0.405819
e -0.810995  0.445044  0.816048
f -0.368439  0.056796  0.961981
h  0.164091 -0.048992  1.284001

## Replacing regular values

In [61]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})

print(df)
print('\n')
print (df.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60


   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

## Groupby

In [2]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
                     'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print(df)
print('\n')
print (df.groupby('Team'))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000024F53620E48>

In [64]:
x = df.groupby('Team')
print (x.mean())

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [45]:
print (df.groupby('Team').median())

        Rank    Year  Points
Team
Devils   2.5  2014.5   768.0
Kings    1.0  2016.0   756.0
Riders   2.0  2015.5   741.5
Royals   2.5  2014.5   752.5
kings    4.0  2015.0   812.0

### View the groups

In [65]:
print (df.groupby('Team').groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

In [66]:
grouped = df.groupby('Year')

for name,group in grouped:
    print (name)
    print (group)
    print('\n')

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701


2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804


2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694


2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

## Aggregations
An aggregated function returns a single aggregated value for each group.

In [67]:
grouped = df.groupby('Year')
print (grouped['Points'].agg(np.mean))
print (grouped['Points'].mean())

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64
Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [10]:
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

In [69]:
df['Points'].agg([np.sum, np.mean, np.std])

sum     9187.000000
mean     765.583333
std       67.849376
Name: Points, dtype: float64

## Merging/Joining

In [70]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

### Merge Two DataFrames on a Key

In [71]:
pd.merge(df1,df2,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [72]:
# looks for equal touples
print(df1)
print(df2)
pd.merge(df1,df2,on=['id','subject_id'])

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

### Left join

In [73]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [74]:
pd.merge(df1,df2, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

### Right join

In [75]:
pd.merge(df1,df2, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

### Outer join

In [76]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [77]:
#take all values of subject_id
pd.merge(df1,df2, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

### Inner join

In [78]:
#take common values of subject_id
pd.merge(df1, df2, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [79]:
?pd.merge

In [60]:
pd.merge(df2, df1, on='subject_id', how='inner')

   id_x Name_x subject_id  id_y  Name_y
0     1  Billy       sub2     2     Amy
1     2  Brian       sub4     3   Allen
2     4  Bryce       sub6     4   Alice
3     5  Betty       sub5     5  Ayoung

### Loading data from a file into a dataframe

In [80]:
s = pd.read_csv('data/gender.txt')
s

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
5                   6|42|M|executive|98101
6               7|57|M|administrator|91344
7               8|36|M|administrator|05201
8                     9|29|M|student|01002
9                     10|53|M|lawyer|90703
10                     11|39|F|other|30329
11                     12|28|F|other|06405
12                  13|47|M|educator|29206
13                 14|45|M|scientist|55106
14                  15|49|F|educator|97301
15             16|21|M|entertainment|10309
16                17|30|M|programmer|06355
17                     18|35|F|other|37212
18                 19|40|M|librarian|02138
19                 20|42|F|homemaker|95660
20                    21|26|M|writer|30068
21                    22|25|M|writer|40206
22                    23|30|F|artist|48197
23                    24|21|F|artist|94533
24                  25|39|M|engineer|55107
25                  26|49|M|engineer|21044
26                 27|40|F|librarian|30030
27                    28|32|M|writer|55369
28                29|41|M|programmer|94043
29                    30|7|M|student|55436
..                                     ...
913                   914|44|F|other|08105
914           915|50|M|entertainment|60614
915                916|27|M|engineer|N2L5N
916                 917|22|F|student|20006
917               918|40|M|scientist|70116
918                   919|25|M|other|14216
919                  920|30|F|artist|90008
920                 921|20|F|student|98801
921           922|29|F|administrator|21114
922                 923|21|M|student|E2E3R
923                   924|29|M|other|11753
924                925|18|F|salesman|49036
925           926|49|M|entertainment|01701
926              927|23|M|programmer|55428
927                 928|21|M|student|55408
928               929|44|M|scientist|53711
929               930|28|F|scientist|07310
930                931|60|M|educator|33556
931                932|58|M|educator|06437
932                 933|28|M|student|48105
933                934|61|M|engineer|22902
934                  935|42|M|doctor|66221
935                   936|24|M|other|32789
936                937|48|M|educator|98072
937              938|38|F|technician|55038
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [83]:
?pd.read_csv

In [81]:
import pandas as pd
s = pd.read_csv('data/gender.txt', sep='|', index_col = 'user_id')
s

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044
27        40      F      librarian    30030
28        32      M         writer    55369
29        41      M     programmer    94043
30         7      M        student    55436
...      ...    ...            ...      ...
914       44      F          other    08105
915       50      M  entertainment    60614
916       27      M       engineer    N2L5N
917       22      F        student    20006
918       40      M      scientist    70116
919       25      M          other    14216
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
923       21      M        student    E2E3R
924       29      M          other    11753
925       18      F       salesman    49036
926       49      M  entertainment    01701
927       23      M     programmer    55428
928       21      M        student    55408
929       44      M      scientist    53711
930       28      F      scientist    07310
931       60      M       educator    33556
932       58      M       educator    06437
933       28      M        student    48105
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [82]:
len(s.columns)

4